> @Osazz In your example, since you don't want to have any `cves` then you should omit it in the TF configuration. This will also match the imported value of `null`.

Here is my full use case , I have existing ignore rules that were created from the UI that I would like to manage using Terraform. Here are the steps I took and how I endup here : 
- Import existing resource into IAC  and state file looks like this : 
```
"instances": [
        {
          "schema_version": 0,
          "attributes": {
            ...
            "cves": null,
            ...
          }
        }
      ]
```

- Do a terraform plan  ( this should returns no changes) 
```
Terraform will perform the following actions:
# xray_ignore_rule.ignore_rule must be replaced
-/+ resource "xray_ignore_rule" "ignore_rule" {
      ~ author          = "dosagie" -> (known after apply)
      ~ created         = "2023-11-17T18:10:49Z" -> (known after apply)
      + cves            = (known after apply) # forces replacement
      ~ id              = "d169e985-87f8-43f5-4bb8-67f73c76f0ef" -> (known after apply)
      ~ is_expired      = false -> (known after apply)
        # (4 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

N.B running apply means new destroying existing resources and creating new one. Not ideal

- Do terraform apply and then check the state file 


